In [1]:
'''
Load the dataset “Online_Retail” provided into pandas dataframe.   
o Process any missing values. Create descriptive statistics.(Use of numpy)   
o Plot time series of price using pandas functionality. Filter transactions based on 
date. 
o Plot time series chart of price where quantity less than 1000 and in year 2011. 
o Calculate total amount of price in pivot table based on product description. 
o Which country has highest price and for which product? 
o Calculate top 10 products with minimum price and in year 2010.'''

'\nLoad the dataset “Online_Retail” provided into pandas dataframe.   \no Process any missing values. Create descriptive statistics.(Use of numpy)   \no Plot time series of price using pandas functionality. Filter transactions based on \ndate. \no Plot time series chart of price where quantity less than 1000 and in year 2011. \no Calculate total amount of price in pivot table based on product description. \no Which country has highest price and for which product? \no Calculate top 10 products with minimum price and in year 2010.'

In [11]:
import numpy as np

In [12]:
import pandas as pd

In [13]:
df=pd.read_csv('online_retail.csv')

In [14]:
df

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country
0,489434,85048,15CM CHRISTMAS GLASS BALL 20 LIGHTS,12,01-12-2009 07:45,6.95,13085.0,United Kingdom
1,489434,79323P,PINK CHERRY LIGHTS,12,01-12-2009 07:45,6.75,13085.0,United Kingdom
2,489434,79323W,WHITE CHERRY LIGHTS,12,01-12-2009 07:45,6.75,13085.0,United Kingdom
3,489434,22041,"RECORD FRAME 7"" SINGLE SIZE",48,01-12-2009 07:45,2.10,13085.0,United Kingdom
4,489434,21232,STRAWBERRY CERAMIC TRINKET BOX,24,01-12-2009 07:45,1.25,13085.0,United Kingdom
...,...,...,...,...,...,...,...,...
437880,C553031,22300,COFFEE MUG DOG + BALL DESIGN,-1,12-05-2011 19:43,2.55,13908.0,United Kingdom
437881,C553031,21533,RETROSPOT LARGE MILK JUG,-3,12-05-2011 19:43,4.95,13908.0,United Kingdom
437882,C553031,21240,BLUE POLKADOT CUP,-3,12-05-2011 19:43,0.85,13908.0,United Kingdom
437883,C553032,22891,TEA FOR ONE POLKADOT,-3,12-05-2011 19:44,4.25,13320.0,United Kingdom
437884,C553032,22631,CIRCUS PARADE LUNCH BOX,-3,12-05-2011 19:44,1.95,13320.0,United Kingdom

In [15]:
df.Description

0         15CM CHRISTMAS GLASS BALL 20 LIGHTS
1                          PINK CHERRY LIGHTS
2                         WHITE CHERRY LIGHTS
3                RECORD FRAME 7" SINGLE SIZE
4              STRAWBERRY CERAMIC TRINKET BOX
                         ...
437880           COFFEE MUG DOG + BALL DESIGN
437881               RETROSPOT LARGE MILK JUG
437882                      BLUE POLKADOT CUP
437883                   TEA FOR ONE POLKADOT
437884               CIRCUS PARADE LUNCH BOX
Name: Description, Length: 437885, dtype: object

In [16]:
df.describe

<bound method NDFrame.describe of         Invoice StockCode                          Description  Quantity  \
0        489434     85048  15CM CHRISTMAS GLASS BALL 20 LIGHTS        12
1        489434    79323P                   PINK CHERRY LIGHTS        12
2        489434    79323W                  WHITE CHERRY LIGHTS        12
3        489434     22041         RECORD FRAME 7" SINGLE SIZE         48
4        489434     21232       STRAWBERRY CERAMIC TRINKET BOX        24
...         ...       ...                                  ...       ...
437880  C553031     22300         COFFEE MUG DOG + BALL DESIGN        -1
437881  C553031     21533             RETROSPOT LARGE MILK JUG        -3
437882  C553031     21240                    BLUE POLKADOT CUP        -3
437883  C553032     22891                 TEA FOR ONE POLKADOT        -3
437884  C553032     22631             CIRCUS PARADE LUNCH BOX         -3

             InvoiceDate  Price  Customer ID         Country
0       01-12-2009 07:45   6.95      13085.0  United Kingdom
1       01-12-2009 07:45   6.75      13085.0  United Kingdom
2       01-12-2009 07:45   6.75      13085.0  United Kingdom
3       01-12-2009 07:45   2.10      13085.0  United Kingdom
4       01-12-2009 07:45   1.25      13085.0  United Kingdom
...                  ...    ...          ...             ...
437880  12-05-2011 19:43   2.55      13908.0  United Kingdom
437881  12-05-2011 19:43   4.95      13908.0  United Kingdom
437882  12-05-2011 19:43   0.85      13908.0  United Kingdom
437883  12-05-2011 19:44   4.25      13320.0  United Kingdom
437884  12-05-2011 19:44   1.95      13320.0  United Kingdom

[437885 rows x 8 columns]>

In [17]:
df.isnull().sum()

Invoice             0
StockCode           0
Description      2723
Quantity            0
InvoiceDate         0
Price               0
Customer ID    110775
Country             0
dtype: int64

In [19]:
removed_null=df.dropna(subset=['Description','Customer ID'],inplace=True)

In [22]:
df.describe

<bound method NDFrame.describe of         Invoice StockCode                          Description  Quantity  \
0        489434     85048  15CM CHRISTMAS GLASS BALL 20 LIGHTS        12
1        489434    79323P                   PINK CHERRY LIGHTS        12
2        489434    79323W                  WHITE CHERRY LIGHTS        12
3        489434     22041         RECORD FRAME 7" SINGLE SIZE         48
4        489434     21232       STRAWBERRY CERAMIC TRINKET BOX        24
...         ...       ...                                  ...       ...
437880  C553031     22300         COFFEE MUG DOG + BALL DESIGN        -1
437881  C553031     21533             RETROSPOT LARGE MILK JUG        -3
437882  C553031     21240                    BLUE POLKADOT CUP        -3
437883  C553032     22891                 TEA FOR ONE POLKADOT        -3
437884  C553032     22631             CIRCUS PARADE LUNCH BOX         -3

             InvoiceDate  Price  Customer ID         Country
0       01-12-2009 07:45   6.95      13085.0  United Kingdom
1       01-12-2009 07:45   6.75      13085.0  United Kingdom
2       01-12-2009 07:45   6.75      13085.0  United Kingdom
3       01-12-2009 07:45   2.10      13085.0  United Kingdom
4       01-12-2009 07:45   1.25      13085.0  United Kingdom
...                  ...    ...          ...             ...
437880  12-05-2011 19:43   2.55      13908.0  United Kingdom
437881  12-05-2011 19:43   4.95      13908.0  United Kingdom
437882  12-05-2011 19:43   0.85      13908.0  United Kingdom
437883  12-05-2011 19:44   4.25      13320.0  United Kingdom
437884  12-05-2011 19:44   1.95      13320.0  United Kingdom

[327110 rows x 8 columns]>

In [23]:
df.isnull().sum()

Invoice        0
StockCode      0
Description    0
Quantity       0
InvoiceDate    0
Price          0
Customer ID    0
Country        0
dtype: int64

In [26]:
df.size

2616880

In [27]:
df.describe()

            Quantity          Price    Customer ID
count  327110.000000  327110.000000  327110.000000
mean       12.971734       3.950415   15309.727813
std       207.017278      74.134111    1697.582041
min    -74215.000000       0.000000   12346.000000
25%         2.000000       1.250000   13901.000000
50%         5.000000       1.950000   15215.000000
75%        12.000000       3.750000   16801.000000
max     74215.000000   25111.090000   18287.000000

In [36]:
df['Total Amount']=df['Quantity']*df['Price']

In [45]:
df['Total Amount']

0          83.40
1          81.00
2          81.00
3         100.80
4          30.00
           ...
437880     -2.55
437881    -14.85
437882     -2.55
437883    -12.75
437884     -5.85
Name: Total Amount, Length: 327110, dtype: float64

In [46]:
df[['Quantity','Price','Total Amount']]

        Quantity  Price  Total Amount
0             12   6.95         83.40
1             12   6.75         81.00
2             12   6.75         81.00
3             48   2.10        100.80
4             24   1.25         30.00
...          ...    ...           ...
437880        -1   2.55         -2.55
437881        -3   4.95        -14.85
437882        -3   0.85         -2.55
437883        -3   4.25        -12.75
437884        -3   1.95         -5.85

[327110 rows x 3 columns]

In [48]:
table=df.pivot_table(values='Total Amount', index='Description' , aggfunc=sum )

C:\Users\VipulGhodke\AppData\Local\Temp\ipykernel_21048\1979502902.py:1: FutureWarning: The provided callable <built-in function sum> is currently using DataFrameGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  table=df.pivot_table(values='Total Amount', index='Description' , aggfunc=sum )

In [49]:
print(table)

                                     Total Amount
Description
  DOORMAT UNION JACK GUNS AND ROSES       1084.75
 3 STRIPEY MICE FELTCRAFT                 1227.45
 4 PURPLE FLOCK DINNER CANDLES              63.75
 ANIMAL STICKERS                            80.85
 BLACK PIRATE TREASURE CHEST                77.55
...                                           ...
ZINC T-LIGHT HOLDER STARS SMALL            908.31
ZINC TOP  2 DOOR WOODEN SHELF             1050.35
ZINC WILLIE WINKIE  CANDLE STICK          1746.44
ZINC WIRE KITCHEN ORGANISER                 20.80
ZINC WIRE SWEETHEART LETTER TRAY            97.71

[4582 rows x 1 columns]